chenlongchoo/EM6300/Meter_Top_Board/Alternative Configurations/HardwareProfile PIC32 Starter Kit ENCX24J600 PSP 5 Indirect.h
//    //----------------------------
//    // ZeroG ZG2100M WiFi I/O pins
//    //----------------------------
//	// If you have a ZeroG ZG2100M WiFi PICtail, you must uncomment one of 
//	// these two lines to use it.  SPI1 is the top-most slot in the Explorer 16 
//	// (closer to the LCD and prototyping area) while SPI2 corresponds to 
//	// insertion of the PICtail into the middle of the side edge connector slot.
//	#define ZG2100_IN_SPI1
//	//#define ZG2100_IN_SPI2
//	
//    #if defined( ZG2100_IN_SPI1 ) && !defined(__32MX460F512L__) && !defined(__32MX795F512L__)
//        // ZG2100 in SPI1 slot
//        #define ZG_CS_TRIS			(TRISBbits.TRISB2)
//    	#define ZG_CS_IO			(LATBbits.LATB2)
//    	#define ZG_SDI_TRIS			(TRISFbits.TRISF7)
//    	#define ZG_SCK_TRIS			(TRISFbits.TRISF6)
//    	#define ZG_SDO_TRIS			(TRISFbits.TRISF8)
//      	#define ZG_RST_TRIS			(TRISFbits.TRISF0)	
//    	#define ZG_RST_IO			(LATFbits.LATF0)  
//        #if defined(__dsPIC33FJ256GP710__) || defined(__PIC24HJ256GP610__)
//			#define ZG_EINT_TRIS	(TRISAbits.TRISA12)
//			#define ZG_EINT_IO		(PORTAbits.RA12)
//        #else
//			#define ZG_EINT_TRIS	(TRISEbits.TRISE8)  // INT1
//			#define ZG_EINT_IO		(PORTEbits.RE8)     
//        #endif
//    	#define XCEN33_TRIS		    (TRISFbits.TRISF1)  
//    	#define	XCEN33_IO			(PORTFbits.RF1)
//    	#if defined( __C30__ )
//            #define ZG_EINT_EDGE		(INTCON2bits.INT1EP)
//        	#define ZG_EINT_IE			(IEC1bits.INT1IE)
//        	#define ZG_EINT_IF			(IFS1bits.INT1IF)
//    	#elif defined( __PIC32MX__ )
//            #define ZG_EINT_EDGE		(INTCONbits.INT1EP)
//        	#define ZG_EINT_IE			(IEC0bits.INT1IE)
//        	#define ZG_EINT_IF			(IFS0bits.INT1IF)
//        	#define ZG_EINT_IE_CLEAR    IEC0CLR
//        	#define ZG_EINT_IF_CLEAR    IFS0CLR
//        	#define ZG_EINT_IE_SET      IEC0SET
//        	#define ZG_EINT_IF_SET      IFS0SET
//        	#define ZG_EINT_BIT         0x00000080
//        	#define ZG_EINT_IPCSET      IPC1SET
//        	#define ZG_EINT_IPCCLR      IPC1CLR
//        	#define ZG_EINT_IPC_MASK    0xFF000000
//        	#define ZG_EINT_IPC_VALUE   0x0C000000
//        #else
//            #error Determine ZG2100 external interrupt
//        #endif
//
//    	#define ZG_SSPBUF			(SPI1BUF)
//    	#define ZG_SPISTAT			(SPI1STAT)
//    	#define ZG_SPISTATbits		(SPI1STATbits)
//    	#if defined( __C30__ )
//        	#define ZG_SPICON1			(SPI1CON1)
//        	#define ZG_SPICON1bits		(SPI1CON1bits)
//        	#define ZG_SPICON2			(SPI1CON2)
//        	#define ZG_SPI_IE			(IEC0bits.SPI1IE)
//    //    	#define ZG_SPI_IP			(IPC2bits.SPI1IP)
//        	#define ZG_SPI_IF			(IFS0bits.SPI1IF)
//        #elif defined( __PIC32MX__ )
//        	#define ZG_SPICON1			(SPI1CON)
//        	#define ZG_SPICON1bits		(SPI1CONbits)
//            #define ZG_SPI_IE_CLEAR     IEC0CLR
//            #define ZG_SPI_IF_CLEAR     IFS0CLR
//            #define ZG_SPI_INT_BITS     0x03800000
//    		#define ZG_SPI_BRG		    (SPI1BRG)
//            #define ZG_MAX_SPI_FREQ     (10000000ul)	// Hz
//        #else
//            #error Determine ZG2100 SPI information
//        #endif
//        
//    #elif defined( ZG2100_IN_SPI2 ) && !defined(__32MX460F512L__) && !defined(__32MX795F512L__)
//        // ZG2100 in SPI2 slot
//        #define ZG_CS_TRIS			(TRISGbits.TRISG9)
//    	#define ZG_CS_IO			(LATGbits.LATG9)
//    	#define ZG_SDI_TRIS			(TRISGbits.TRISG7)
//    	#define ZG_SCK_TRIS			(TRISGbits.TRISG6)
//    	#define ZG_SDO_TRIS			(TRISGbits.TRISG8)
//      	#define ZG_RST_TRIS			(TRISGbits.TRISG0)	
//    	#define ZG_RST_IO			(LATGbits.LATG0)  
//    	#define ZG_EINT_TRIS		(TRISAbits.TRISA14) // INT3 
//    	#define ZG_EINT_IO			(PORTAbits.RA14)     
//    	#define XCEN33_TRIS		    (TRISGbits.TRISG1)  
//    	#define	XCEN33_IO			(PORTGbits.RG1)
//    	#if defined( __C30__ )
//            #define ZG_EINT_EDGE		(INTCON2bits.INT3EP)
//        	#define ZG_EINT_IE			(IEC3bits.INT3IE)
//        	#define ZG_EINT_IF			(IFS3bits.INT3IF)
//    	#elif defined( __PIC32MX__ )
//            #define ZG_EINT_EDGE		(INTCONbits.INT3EP)
//        	#define ZG_EINT_IE			(IEC0bits.INT3IE)
//        	#define ZG_EINT_IF			(IFS0bits.INT3IF)
//        	#define ZG_EINT_IE_CLEAR    IEC0CLR
//        	#define ZG_EINT_IF_CLEAR    IFS0CLR
//        	#define ZG_EINT_IE_SET      IEC0SET
//        	#define ZG_EINT_IF_SET      IFS0SET
//        	#define ZG_EINT_BIT         0x00008000
//        	#define ZG_EINT_IPCSET      IPC3SET
//        	#define ZG_EINT_IPCCLR      IPC3CLR
//        	#define ZG_EINT_IPC_MASK    0xFF000000
//        	#define ZG_EINT_IPC_VALUE   0x0C000000
//        #else
//            #error Determine ZG2100 external interrupt
//        #endif
//        
//    	#define ZG_SSPBUF			(SPI2BUF)
//    	#define ZG_SPISTAT			(SPI2STAT)
//    	#define ZG_SPISTATbits		(SPI2STATbits)
//    	#if defined( __C30__ )
//        	#define ZG_SPICON1			(SPI2CON1)
//        	#define ZG_SPICON1bits		(SPI2CON1bits)
//        	#define ZG_SPICON2			(SPI2CON2)
//        	#define ZG_SPI_IE			(IEC2bits.SPI2IE)
//    //    	#define ZG_SPI_IP			(IPC8bits.SPI2IP)
//        	#define ZG_SPI_IF			(IFS2bits.SPI2IF)
//        #elif defined( __PIC32MX__ )
//        	#define ZG_SPICON1			(SPI2CON)
//        	#define ZG_SPICON1bits		(SPI2CONbits)
//            #define ZG_SPI_IE_CLEAR     IEC1CLR
//            #define ZG_SPI_IF_CLEAR     IFS1CLR
//            #define ZG_SPI_INT_BITS     0x000000e0
//    		#define ZG_SPI_BRG		    (SPI2BRG)
//            #define ZG_MAX_SPI_FREQ     (10000000ul)	// Hz
//        #else
//            #error Determine ZG2100 SPI information
//        #endif
//
//	#elif defined( ZG2100_IN_SPI1 ) && (defined(__32MX460F512L__) || defined(__32MX795F512L__))
//        // ZG2100 in SPI1 slot
//        #define ZG_CS_TRIS			(TRISDbits.TRISD9)
//    	#define ZG_CS_IO			(LATDbits.LATD9)
//    	#define ZG_SDI_TRIS			(TRISCbits.TRISC4)
//    	#define ZG_SCK_TRIS			(TRISDbits.TRISD10)
//    	#define ZG_SDO_TRIS			(TRISDbits.TRISD0)
//      	#define ZG_RST_TRIS			(TRISFbits.TRISF0)	
//    	#define ZG_RST_IO			(LATFbits.LATF0)  
//    	#define ZG_EINT_TRIS		(TRISEbits.TRISE8)  // INT1  
//    	#define ZG_EINT_IO			(PORTEbits.RE8)     
//    	#define XCEN33_TRIS		    (TRISFbits.TRISF1)  
//    	#define	XCEN33_IO			(PORTFbits.RF1)
//    	#if defined( __C30__ )
//            #define ZG_EINT_EDGE		(INTCON2bits.INT1EP)
//        	#define ZG_EINT_IE			(IEC1bits.INT1IE)
//        	#define ZG_EINT_IF			(IFS1bits.INT1IF)
//    	#elif defined( __PIC32MX__ )
//            #define ZG_EINT_EDGE		(INTCONbits.INT1EP)
//        	#define ZG_EINT_IE			(IEC0bits.INT1IE)
//        	#define ZG_EINT_IF			(IFS0bits.INT1IF)
//        	#define ZG_EINT_IE_CLEAR    IEC0CLR
//        	#define ZG_EINT_IF_CLEAR    IFS0CLR
//        	#define ZG_EINT_IE_SET      IEC0SET
//        	#define ZG_EINT_IF_SET      IFS0SET
//        	#define ZG_EINT_BIT         0x00000080
//        	#define ZG_EINT_IPCSET      IPC1SET
//        	#define ZG_EINT_IPCCLR      IPC1CLR
//        	#define ZG_EINT_IPC_MASK    0xFF000000
//        	#define ZG_EINT_IPC_VALUE   0x0C000000
//        #else
//            #error Determine ZG2100 external interrupt
//        #endif
//
//    	#define ZG_SSPBUF			(SPI1BUF)
//    	#define ZG_SPISTAT			(SPI1STAT)
//    	#define ZG_SPISTATbits		(SPI1STATbits)
//    	#if defined( __C30__ )
//        	#define ZG_SPICON1			(SPI1CON1)
//        	#define ZG_SPICON1bits		(SPI1CON1bits)
//        	#define ZG_SPICON2			(SPI1CON2)
//        	#define ZG_SPI_IE			(IEC0bits.SPI1IE)
//    //    	#define ZG_SPI_IP			(IPC2bits.SPI1IP)
//        	#define ZG_SPI_IF			(IFS0bits.SPI1IF)
//        #elif defined( __PIC32MX__ )
//        	#define ZG_SPICON1			(SPI1CON)
//        	#define ZG_SPICON1bits		(SPI1CONbits)
//            #define ZG_SPI_IE_CLEAR     IEC0CLR
//            #define ZG_SPI_IF_CLEAR     IFS0CLR
//            #define ZG_SPI_INT_BITS     0x03800000
//    		#define ZG_SPI_BRG		    (SPI1BRG)
//            #define ZG_MAX_SPI_FREQ     (10000000ul)	// Hz
//        #else
//            #error Determine ZG2100 SPI information
//        #endif
//    #elif defined( ZG2100_IN_SPI2 ) && (defined(__32MX460F512L__) || defined(__32MX795F512L__))
//    	#error "/RST and /CE are on RG2 and RG3 which are multiplexed with USB D+ and D-."
//    #endif

