chenlongchoo/EM6300/Meter_Top_Board/Alternative Configurations/HardwareProfile PIC32 Starter Kit ENCX24J600 PSP 5 Indirect.h
	// ENC424J600/624J600 parallel indirect address remapping macro function.
	// This section translates SFR and RAM addresses presented to the 
	// ReadMemory() and WriteMemory() APIs in ENCX24J600.c to the actual 
	// addresses that must be presented on the parallel interface.  This macro 
	// must be modified to match your hardware if you are using an indirect PSP 
	// addressing mode (ENC100_PSP_USE_INDIRECT_RAM_ADDRESSING is defined) and 
	// have some of your address lines tied off to Vdd.  If you are using the 
	// SPI interface, then this section can be ignored or deleted.
	#if (ENC100_INTERFACE_MODE == 1) || (ENC100_INTERFACE_MODE == 2) || (ENC100_INTERFACE_MODE == 5) || (ENC100_INTERFACE_MODE == 6) // 8-bit PSP
		#define ENC100_TRANSLATE_TO_PIN_ADDR(a)		((((a)&0x0100)<<6) | ((a)&0x00FF))
	#elif (ENC100_INTERFACE_MODE == 3) || (ENC100_INTERFACE_MODE == 4) // 16-bit PSP
		#define ENC100_TRANSLATE_TO_PIN_ADDR(a)		(a)
	#endif

	// Auto-crossover pins on Fast 100Mbps Ethernet PICtail/PICtail Plus.  If 
	// your circuit doesn't have such a feature, delete these two defines.
	#define ENC100_MDIX_TRIS				(TRISBbits.TRISB3)
	#define ENC100_MDIX_IO					(LATBbits.LATB3)

	// ENC624J600 I/O control and status pins
	// If a pin is not required for your selected ENC100_INTERFACE_MODE 
	// interface selection (ex: WRH/B1SEL for PSP modes 1, 2, 5, and 6), then 
	// you can ignore, delete, or put anything for the pin definition.  Also, 
	// the INT and POR pins are entirely optional.  If not connected, comment 
	// them out.
	#define ENC100_INT_TRIS					(TRISEbits.TRISE9)		// INT signal is optional and currently unused in the Microchip TCP/IP Stack.  Leave this pin disconnected and comment out this pin definition if you don't want it.
	#define ENC100_INT_IO					(PORTEbits.RE9)
	#if (ENC100_INTERFACE_MODE >= 1)	// Parallel mode
		// PSP control signal pinout
		#define ENC100_CS_TRIS					(TRISAbits.TRISA5)	// CS is optional in PSP mode.  If you are not sharing the parallel bus with another device, tie CS to Vdd and comment out this pin definition.
		#define ENC100_CS_IO					(LATAbits.LATA5)
		#define ENC100_POR_TRIS					(TRISCbits.TRISC1)	// POR signal is optional.  If your application doesn't have a power disconnect feature, comment out this pin definition.
		#define ENC100_POR_IO					(LATCbits.LATC1)
		#define ENC100_SO_WR_B0SEL_EN_TRIS		(TRISDbits.TRISD4)
		#define ENC100_SO_WR_B0SEL_EN_IO		(LATDbits.LATD4)
		#define ENC100_SI_RD_RW_TRIS			(TRISDbits.TRISD5)
		#define ENC100_SI_RD_RW_IO				(LATDbits.LATD5)
		#define ENC100_SCK_AL_TRIS				(TRISBbits.TRISB15)
		#define ENC100_SCK_AL_IO				(LATBbits.LATB15)
	#else	
		// SPI pinout
    	#if defined ENC_IN_SPI1
        	#define ENC100_CS_TRIS					(TRISDbits.TRISD14)	// CS is mandatory when using the SPI interface
        	#define ENC100_CS_IO					(LATDbits.LATD14)
        	#define ENC100_POR_TRIS					(TRISDbits.TRISD15)	// POR signal is optional.  If your application doesn't have a power disconnect feature, comment out this pin definition.
        	#define ENC100_POR_IO					(LATDbits.LATD15)
        	#define ENC100_SO_WR_B0SEL_EN_TRIS		(TRISFbits.TRISF7)	// SO is ENCX24J600 Serial Out, which needs to connect to the PIC SDI pin for SPI mode
        	#define ENC100_SO_WR_B0SEL_EN_IO		(PORTFbits.RF7)
        	#define ENC100_SI_RD_RW_TRIS			(TRISFbits.TRISF8)	// SI is ENCX24J600 Serial In, which needs to connect to the PIC SDO pin for SPI mode
        	#define ENC100_SI_RD_RW_IO				(LATFbits.LATF8)
        	#define ENC100_SCK_AL_TRIS				(TRISFbits.TRISF6)
        #elif defined ENC_IN_SPI2
            #define ENC100_CS_TRIS					(TRISFbits.TRISF12)
    		#define ENC100_CS_IO					(LATFbits.LATF12)
    		#define ENC100_POR_TRIS					(TRISFbits.TRISF13)
    		#define ENC100_POR_IO					(LATFbits.LATF13)
    		#define ENC100_SO_WR_B0SEL_EN_TRIS		(TRISGbits.TRISG7)	// NOTE: SO is ENC624J600 Serial Out, which needs to connect to the PIC SDI pin for SPI mode
    		#define ENC100_SO_WR_B0SEL_EN_IO		(PORTGbits.RG7)
    		#define ENC100_SI_RD_RW_TRIS			(TRISGbits.TRISG8)	// NOTE: SI is ENC624J600 Serial In, which needs to connect to the PIC SDO pin for SPI mode
    		#define ENC100_SI_RD_RW_IO				(LATGbits.LATG8)
    		#define ENC100_SCK_AL_TRIS				(TRISGbits.TRISG6)
    		#define ENC100_SCK_AL_IO				(PORTGbits.RG6)		// NOTE: This must be the PORT, not the LATch like it is for the PSP interface.
        #endif
    #endif


	// ENC624J600 SPI SFR register selection (controls which SPI peripheral to 
	// use on PICs with multiple SPI peripherals).  If a parallel interface is 
	// used (ENC100_INTERFACE_MODE is >= 1), then the SPI is not used and this 
	// section can be ignored or deleted.
	#if defined ENC_IN_SPI1
		#define ENC100_ISR_ENABLE		(IEC0bits.INT2IE)
		#define ENC100_ISR_FLAG			(IFS0bits.INT2IF)
		#define ENC100_ISR_POLARITY		(INTCONbits.INT2EP)	
		#define ENC100_ISR_PRIORITY		(IPC2bits.INT2IP)	
		#define ENC100_SPI_ENABLE		(ENC100_SPICON1bits.ON)
		#define ENC100_SPI_IF			(IFS0bits.SPI1RXIF)
		#define ENC100_SSPBUF			(SPI1BUF)
		#define ENC100_SPICON1			(SPI1CON)
		#define ENC100_SPISTATbits		(SPI1STATbits)
		#define ENC100_SPICON1bits		(SPI1CONbits)
		#define ENC100_SPIBRG			(SPI1BRG)
	#elif defined ENC_IN_SPI2
		#define ENC100_ISR_ENABLE		(IEC0bits.INT4IE)
		#define ENC100_ISR_FLAG			(IFS0bits.INT4IF)
		#define ENC100_ISR_POLARITY		(INTCONbits.INT4EP)	
		#define ENC100_ISR_PRIORITY		(IPC2bits.INT4IP)	
		#define ENC100_SPI_ENABLE		(ENC100_SPICON1bits.ON)
		#define ENC100_SPI_IF			(IFS1bits.SPI2RXIF)
		#define ENC100_SSPBUF			(SPI2BUF)
		#define ENC100_SPICON1			(SPI2CON)
		#define ENC100_SPISTATbits		(SPI2STATbits)
		#define ENC100_SPICON1bits		(SPI2CONbits)
		#define ENC100_SPIBRG			(SPI2BRG)
	#endif
 

//	//----------------------------
//	// ZeroG ZG2100M WiFi I/O pins
//	//----------------------------
//	// If you have a ZeroG ZG2100M WiFi PICtail, you must uncomment one of 
//	// these two lines to use it.  SPI1 is the top-most slot while SPI2 corresponds to 
//	// insertion of the PICtail into the middle of the side edge connector slot.
//
//	#define ZG2100_IN_SPI1
//	//#define ZG2100_IN_SPI2
//	#if defined( ZG2100_IN_SPI1 )
//		// ZG2100 in SPI1 slot
//		#define ZG_CS_TRIS			(TRISBbits.TRISB2)
//    	#define ZG_CS_IO			(LATBbits.LATB2)
//    	#define ZG_SDI_TRIS			(TRISFbits.TRISF7)
//    	#define ZG_SCK_TRIS			(TRISFbits.TRISF6)
//    	#define ZG_SDO_TRIS			(TRISFbits.TRISF8)
//      	#define ZG_RST_TRIS			(TRISFbits.TRISF0)	
//    	#define ZG_RST_IO			(LATFbits.LATF0)  
//    	#define ZG_EINT_TRIS		(TRISEbits.TRISE8)  // INT1  
//    	#define ZG_EINT_IO			(PORTEbits.RE8)     
//    	#define XCEN33_TRIS		    (TRISFbits.TRISF1)  
//    	#define	XCEN33_IO			(PORTFbits.RF1)
//    	#if defined( __C30__ )
//           #define ZG_EINT_EDGE		(INTCON2bits.INT1EP)
//        	#define ZG_EINT_IE			(IEC1bits.INT1IE)
//        	#define ZG_EINT_IF			(IFS1bits.INT1IF)
//    	#elif defined( __PIC32MX__ )
//           #define ZG_EINT_EDGE		(INTCONbits.INT1EP)
//        	#define ZG_EINT_IE			(IEC0bits.INT1IE)
//        	#define ZG_EINT_IF			(IFS0bits.INT1IF)
//        	#define ZG_EINT_IE_CLEAR    IEC0CLR
//        	#define ZG_EINT_IF_CLEAR    IFS0CLR
//        	#define ZG_EINT_IE_SET      IEC0SET
//        	#define ZG_EINT_IF_SET      IFS0SET
//        	#define ZG_EINT_BIT         0x00000080
//        	#define ZG_EINT_IPCSET      IPC1SET
//        	#define ZG_EINT_IPCCLR      IPC1CLR
//        	#define ZG_EINT_IPC_MASK    0xFF000000
//        	#define ZG_EINT_IPC_VALUE   0x0C000000
//       #else
//           #error Determine ZG2100 external interrupt
//       #endif
//
//    	#define ZG_SSPBUF			(SPI1BUF)
//    	#define ZG_SPISTAT			(SPI1STAT)
//    	#define ZG_SPISTATbits		(SPI1STATbits)
//    	#if defined( __C30__ )
//        	#define ZG_SPICON1			(SPI1CON1)
//        	#define ZG_SPICON1bits		(SPI1CON1bits)
//        	#define ZG_SPICON2			(SPI1CON2)
//        	#define ZG_SPI_IE			(IEC0bits.SPI1IE)
//    //    	#define ZG_SPI_IP			(IPC2bits.SPI1IP)
//        	#define ZG_SPI_IF			(IFS0bits.SPI1IF)
//       #elif defined( __PIC32MX__ )
//        	#define ZG_SPICON1			(SPI1CON)
//        	#define ZG_SPICON1bits		(SPI1CONbits)
//           #define ZG_SPI_IE_CLEAR     IEC0CLR
//           #define ZG_SPI_IF_CLEAR     IFS0CLR
//           #define ZG_SPI_INT_BITS     0x03800000
//    		#define ZG_SPI_BRG		    (SPI1BRG)
//           #define ZG_MAX_SPI_FREQ     (10000000ul)	// Hz
//       #else
//           #error Determine ZG2100 SPI information
//		#endif
//        
//	#elif defined( ZG2100_IN_SPI2 )
//       // ZG2100 in SPI2 slot
//       #define ZG_CS_TRIS			(TRISGbits.TRISG9)
//    	#define ZG_CS_IO			(LATGbits.LATG9)
//    	#define ZG_SDI_TRIS			(TRISGbits.TRISG7)
//    	#define ZG_SCK_TRIS			(TRISGbits.TRISG6)
//    	#define ZG_SDO_TRIS			(TRISGbits.TRISG8)
//      	#define ZG_RST_TRIS			(TRISGbits.TRISG0)	
//    	#define ZG_RST_IO			(LATGbits.LATG0)  
//    	#define ZG_EINT_TRIS		(TRISAbits.TRISA14) // INT3 
//    	#define ZG_EINT_IO			(PORTAbits.RA14)     
//    	#define XCEN33_TRIS		    (TRISGbits.TRISG1)  
//    	#define	XCEN33_IO			(PORTGbits.RG1)
//    	#if defined( __C30__ )
//           #define ZG_EINT_EDGE		(INTCON2bits.INT3EP)
//        	#define ZG_EINT_IE			(IEC3bits.INT3IE)
//        	#define ZG_EINT_IF			(IFS3bits.INT3IF)
//    	#elif defined( __PIC32MX__ )
//           #define ZG_EINT_EDGE		(INTCONbits.INT3EP)
//        	#define ZG_EINT_IE			(IEC0bits.INT3IE)
//        	#define ZG_EINT_IF			(IFS0bits.INT3IF)
//        	#define ZG_EINT_IE_CLEAR    IEC0CLR
//        	#define ZG_EINT_IF_CLEAR    IFS0CLR
//        	#define ZG_EINT_IE_SET      IEC0SET
//        	#define ZG_EINT_IF_SET      IFS0SET
//        	#define ZG_EINT_BIT         0x00008000
//        	#define ZG_EINT_IPCSET      IPC3SET
//        	#define ZG_EINT_IPCCLR      IPC3CLR
//        	#define ZG_EINT_IPC_MASK    0xFF000000
//        	#define ZG_EINT_IPC_VALUE   0x0C000000
//       #else
//			#error Determine ZG2100 external interrupt
//       #endif
//        
//    	#define ZG_SSPBUF			(SPI2BUF)
//    	#define ZG_SPISTAT			(SPI2STAT)
//    	#define ZG_SPISTATbits		(SPI2STATbits)
//    	#if defined( __C30__ )
//        	#define ZG_SPICON1			(SPI2CON1)
//        	#define ZG_SPICON1bits		(SPI2CON1bits)
//        	#define ZG_SPICON2			(SPI2CON2)
//        	#define ZG_SPI_IE			(IEC2bits.SPI2IE)
//    //    	#define ZG_SPI_IP			(IPC8bits.SPI2IP)
//        	#define ZG_SPI_IF			(IFS2bits.SPI2IF)
//       #elif defined( __PIC32MX__ )
//        	#define ZG_SPICON1			(SPI2CON)
//        	#define ZG_SPICON1bits		(SPI2CONbits)
//           #define ZG_SPI_IE_CLEAR     IEC1CLR
//           #define ZG_SPI_IF_CLEAR     IFS1CLR
//           #define ZG_SPI_INT_BITS     0x000000e0
//    		#define ZG_SPI_BRG		    (SPI2BRG)
//           #define ZG_MAX_SPI_FREQ     (10000000ul)	// Hz
//       #else
//			#error Determine ZG2100 SPI information
//		#endif
//	#endif


